Revit 2027 API
ParameterTypeId.TickMarkPen Property
 "Tick Mark Line Weight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TickMarkPen { get; }
Public Shared ReadOnly Property TickMarkPen As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TickMarkPen {
	ForgeTypeId^ get ();
}
static member TickMarkPen : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace